04_tests/performance/results/20260830-224711-formal-monolith-start-secondhand-auction-bid-run1-console.log


  █ THRESHOLDS

    business_guarded
    ✓ 'rate<0.01' rate=0.00%

    business_success
    ✓ 'rate>0.99' rate=100.00%

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=285.46ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    server_error
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 1664    55.071675/s
    checks_succeeded...: 100.00% 1664 out of 1664
    checks_failed......: 0.00%   0 out of 1664

    ✓ auction bid: no server error
    ✓ auction bid: business success

    CUSTOM
    business_guarded...............: 0.00%   0 out of 832
    business_success...............: 100.00% 832 out of 832
    server_error...................: 0.00%   0 out of 832

    HTTP
    http_req_duration..............: avg=159.15ms min=40.28ms  med=151.95ms max=556.03ms p(90)=254.01ms p(95)=285.46ms
      { expected_response:true }...: avg=159.15ms min=40.28ms  med=151.95ms max=556.03ms p(90)=254.01ms p(95)=285.46ms
    http_req_failed................: 0.00%   0 out of 832
    http_reqs......................: 832     27.535837/s

    EXECUTION
    iteration_duration.............: avg=362.45ms min=242.25ms med=354.41ms max=759.76ms p(90)=458.49ms p(95)=490.43ms
    iterations.....................: 832     27.535837/s
    vus............................: 10      min=10         max=10
    vus_max........................: 10      min=10         max=10

    NETWORK
    data_received..................: 2.7 MB  88 kB/s
    data_sent......................: 352 kB  12 kB/s