04_tests/performance/results/20260830-224711-formal-monolith-start-secondhand-auction-bid-run2-console.log


  █ THRESHOLDS

    business_guarded
    ✓ 'rate<0.01' rate=0.00%

    business_success
    ✓ 'rate>0.99' rate=100.00%

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=146.6ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    server_error
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 2084    68.951471/s
    checks_succeeded...: 100.00% 2084 out of 2084
    checks_failed......: 0.00%   0 out of 2084

    ✓ auction bid: no server error
    ✓ auction bid: business success

    CUSTOM
    business_guarded...............: 0.00%   0 out of 1042
    business_success...............: 100.00% 1042 out of 1042
    server_error...................: 0.00%   0 out of 1042

    HTTP
    http_req_duration..............: avg=87.02ms  min=39.63ms  med=80.33ms  max=370.8ms  p(90)=126.42ms p(95)=146.6ms
      { expected_response:true }...: avg=87.02ms  min=39.63ms  med=80.33ms  max=370.8ms  p(90)=126.42ms p(95)=146.6ms
    http_req_failed................: 0.00%   0 out of 1042
    http_reqs......................: 1042    34.475736/s

    EXECUTION
    iteration_duration.............: avg=289.48ms min=241.18ms med=282.36ms max=572.44ms p(90)=328.33ms p(95)=355.71ms
    iterations.....................: 1042    34.475736/s
    vus............................: 10      min=10           max=10
    vus_max........................: 10      min=10           max=10

    NETWORK
    data_received..................: 3.4 MB  113 kB/s
    data_sent......................: 441 kB  15 kB/s