04_tests/performance/results/20260830-224711-formal-monolith-start-secondhand-auction-bid-run3-console.log


  █ THRESHOLDS

    business_guarded
    ✓ 'rate<0.01' rate=0.00%

    business_success
    ✓ 'rate>0.99' rate=100.00%

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=152.67ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    server_error
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 2132    70.386393/s
    checks_succeeded...: 100.00% 2132 out of 2132
    checks_failed......: 0.00%   0 out of 2132

    ✓ auction bid: no server error
    ✓ auction bid: business success

    CUSTOM
    business_guarded...............: 0.00%   0 out of 1066
    business_success...............: 100.00% 1066 out of 1066
    server_error...................: 0.00%   0 out of 1066

    HTTP
    http_req_duration..............: avg=80.46ms  min=36.97ms  med=68.63ms  max=461.6ms  p(90)=119.66ms p(95)=152.67ms
      { expected_response:true }...: avg=80.46ms  min=36.97ms  med=68.63ms  max=461.6ms  p(90)=119.66ms p(95)=152.67ms
    http_req_failed................: 0.00%   0 out of 1066
    http_reqs......................: 1066    35.193196/s

    EXECUTION
    iteration_duration.............: avg=282.83ms min=238.58ms med=270.86ms max=663.37ms p(90)=321.74ms p(95)=354.3ms
    iterations.....................: 1066    35.193196/s
    vus............................: 10      min=10           max=10
    vus_max........................: 10      min=10           max=10

    NETWORK
    data_received..................: 3.5 MB  115 kB/s
    data_sent......................: 451 kB  15 kB/s