04_tests/performance/results/20260830-224711-formal-secondhand-service-secondhand-auction-bid-run2-console.log


  █ THRESHOLDS

    business_guarded
    ✓ 'rate<0.01' rate=0.00%

    business_success
    ✓ 'rate>0.99' rate=100.00%

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=62.73ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    server_error
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 2474    81.812336/s
    checks_succeeded...: 100.00% 2474 out of 2474
    checks_failed......: 0.00%   0 out of 2474

    ✓ auction bid: no server error
    ✓ auction bid: business success

    CUSTOM
    business_guarded...............: 0.00%   0 out of 1237
    business_success...............: 100.00% 1237 out of 1237
    server_error...................: 0.00%   0 out of 1237

    HTTP
    http_req_duration..............: avg=41.36ms  min=23.4ms   med=38.04ms  max=195.78ms p(90)=55.61ms p(95)=62.73ms
      { expected_response:true }...: avg=41.36ms  min=23.4ms   med=38.04ms  max=195.78ms p(90)=55.61ms p(95)=62.73ms
    http_req_failed................: 0.00%   0 out of 1237
    http_reqs......................: 1237    40.906168/s

    EXECUTION
    iteration_duration.............: avg=243.49ms min=224.98ms med=240.05ms max=397.28ms p(90)=258.3ms p(95)=266.65ms
    iterations.....................: 1237    40.906168/s
    vus............................: 10      min=10           max=10
    vus_max........................: 10      min=10           max=10

    NETWORK
    data_received..................: 4.1 MB  134 kB/s
    data_sent......................: 523 kB  17 kB/s