04_tests/performance/results/20260830-224711-formal-secondhand-service-secondhand-auction-bid-run3-console.log


  █ THRESHOLDS

    business_guarded
    ✓ 'rate<0.01' rate=0.00%

    business_success
    ✓ 'rate>0.99' rate=100.00%

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=62.54ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    server_error
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 2492    82.504694/s
    checks_succeeded...: 100.00% 2492 out of 2492
    checks_failed......: 0.00%   0 out of 2492

    ✓ auction bid: no server error
    ✓ auction bid: business success

    CUSTOM
    business_guarded...............: 0.00%   0 out of 1246
    business_success...............: 100.00% 1246 out of 1246
    server_error...................: 0.00%   0 out of 1246

    HTTP
    http_req_duration..............: avg=39.63ms  min=22.7ms   med=37.1ms   max=145.66ms p(90)=53.61ms p(95)=62.54ms
      { expected_response:true }...: avg=39.63ms  min=22.7ms   med=37.1ms   max=145.66ms p(90)=53.61ms p(95)=62.54ms
    http_req_failed................: 0.00%   0 out of 1246
    http_reqs......................: 1246    41.252347/s

    EXECUTION
    iteration_duration.............: avg=241.64ms min=223.98ms med=239.06ms max=347.37ms p(90)=255ms   p(95)=264.83ms
    iterations.....................: 1246    41.252347/s
    vus............................: 10      min=10           max=10
    vus_max........................: 10      min=10           max=10

    NETWORK
    data_received..................: 4.1 MB  136 kB/s
    data_sent......................: 527 kB  17 kB/s